products/admin/fedexwsdl/RateRequest_EMEA_ADG_IEF_v13.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v13="http://fedex.com/ws/rate/v13">
   <soapenv:Header/>
   <soapenv:Body>
      <v13:RateRequest>
          <v13:WebAuthenticationDetail>
            <v13:UserCredential>
               <v13:Key></v13:Key>
               <v13:Password/>
            </v13:UserCredential>
         </v13:WebAuthenticationDetail>
         <v13:ClientDetail>
            <v13:AccountNumber></v13:AccountNumber>
            <v13:MeterNumber></v13:MeterNumber>
         </v13:ClientDetail>
         <v13:TransactionDetail>
            <v13:CustomerTransactionId>RateRequest_Condor_EMEA_ADG_IEF</v13:CustomerTransactionId>
         </v13:TransactionDetail>
         <v13:Version>
            <v13:ServiceId>crs</v13:ServiceId>
            <v13:Major>13</v13:Major>
            <v13:Intermediate>0</v13:Intermediate>
            <v13:Minor>0</v13:Minor>
         </v13:Version>
         <v13:RequestedShipment>
            <v13:ShipTimestamp>2011-06-15T12:34:56-06:00</v13:ShipTimestamp>
            <v13:DropoffType>REGULAR_PICKUP</v13:DropoffType>
            <v13:ServiceType>INTERNATIONAL_ECONOMY_FREIGHT</v13:ServiceType>
            <v13:PackagingType>YOUR_PACKAGING</v13:PackagingType>
            <v13:Shipper>
               <v13:Contact>
                  <v13:PersonName>Abhay</v13:PersonName>
                  <v13:CompanyName>WAPISENDER-WBUS1100</v13:CompanyName>
                  <v13:PhoneNumber>9012704839</v13:PhoneNumber>
                  <v13:EMailAddress>sender@yahoo.com</v13:EMailAddress>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>Sender_Address_Line1</v13:StreetLines>
                  <v13:StreetLines>Sender_Address_Line2</v13:StreetLines>
                  <v13:City>Houston</v13:City>
                  <v13:StateOrProvinceCode>TX</v13:StateOrProvinceCode>
                  <v13:PostalCode>77216</v13:PostalCode>
                  <v13:CountryCode>US</v13:CountryCode>
               </v13:Address>
            </v13:Shipper>
            <v13:Recipient>
               <v13:Contact>
                  <v13:PersonName>Recipient_Name</v13:PersonName>
                  <v13:CompanyName>CSCSWAPI-WBUS1100</v13:CompanyName>
                  <v13:PhoneNumber>9018549236</v13:PhoneNumber>
                  <v13:EMailAddress>recipient@yahoo.com</v13:EMailAddress>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>Recipient_Address_Line1</v13:StreetLines>
                  <v13:StreetLines>Recipient_Address_Line2</v13:StreetLines>
                  <v13:City>London</v13:City>
                  <v13:StateOrProvinceCode>GB</v13:StateOrProvinceCode>
                  <v13:PostalCode>EC1</v13:PostalCode>
                  <v13:CountryCode>GB</v13:CountryCode>
               </v13:Address>
            </v13:Recipient>
            <v13:ShippingChargesPayment>
               <v13:PaymentType>SENDER</v13:PaymentType>
               <v13:Payor>
                  <v13:ResponsibleParty>
                     <v13:AccountNumber/>
                     <v13:Tins>
                        <v13:TinType>BUSINESS_STATE</v13:TinType>
                        <v13:Number>123456</v13:Number>
                     </v13:Tins>
                  </v13:ResponsibleParty>
               </v13:Payor>
            </v13:ShippingChargesPayment>
            <v13:ExpressFreightDetail>
               <v13:PackingListEnclosed>1</v13:PackingListEnclosed>
               <v13:ShippersLoadAndCount>2</v13:ShippersLoadAndCount>
               <v13:BookingConfirmationNumber>123asd789</v13:BookingConfirmationNumber>
            </v13:ExpressFreightDetail>
            <v13:CustomsClearanceDetail>
               <v13:DutiesPayment>
                  <v13:PaymentType>SENDER</v13:PaymentType>
                  <v13:Payor>
                     <v13:ResponsibleParty>
                        <v13:AccountNumber/>
                        <v13:Tins>
                           <v13:TinType>BUSINESS_STATE</v13:TinType>
                           <v13:Number>123456</v13:Number>
                        </v13:Tins>
                     </v13:ResponsibleParty>
                  </v13:Payor>
               </v13:DutiesPayment>
               <v13:DocumentContent>DOCUMENTS_ONLY</v13:DocumentContent>
               <v13:CustomsValue>
                  <v13:Currency>USD</v13:Currency>
                  <v13:Amount>100.00</v13:Amount>
               </v13:CustomsValue>
               <v13:CommercialInvoice>
                  <v13:TermsOfSale>FOB_OR_FCA</v13:TermsOfSale>
               </v13:CommercialInvoice>
               <v13:Commodities>
                  <v13:NumberOfPieces>1</v13:NumberOfPieces>
                  <v13:Description>ABCD</v13:Description>
                  <v13:CountryOfManufacture>US</v13:CountryOfManufacture>
                  <v13:Weight>
                     <v13:Units>LB</v13:Units>
                     <v13:Value>1.0</v13:Value>
                  </v13:Weight>
                  <v13:Quantity>1</v13:Quantity>
                  <v13:QuantityUnits>cm</v13:QuantityUnits>
                  <v13:UnitPrice>
                     <v13:Currency>USD</v13:Currency>
                     <v13:Amount>1.000000</v13:Amount>
                  </v13:UnitPrice>
                  <v13:CustomsValue>
                     <v13:Currency>USD</v13:Currency>
                     <v13:Amount>100.000000</v13:Amount>
                  </v13:CustomsValue>
               </v13:Commodities>
               <v13:ExportDetail>
                  <v13:ExportComplianceStatement>30.37(f)</v13:ExportComplianceStatement>
               </v13:ExportDetail>
            </v13:CustomsClearanceDetail>
            <v13:LabelSpecification>
               <v13:LabelFormatType>COMMON2D</v13:LabelFormatType>
               <v13:ImageType>PNG</v13:ImageType>
               <v13:LabelStockType>PAPER_7X4.75</v13:LabelStockType>
            </v13:LabelSpecification>
            <v13:RateRequestTypes>ACCOUNT</v13:RateRequestTypes>
            <v13:PackageCount>1</v13:PackageCount>
            <v13:RequestedPackageLineItems>
               <v13:SequenceNumber>1</v13:SequenceNumber>
               <v13:GroupPackageCount>1</v13:GroupPackageCount>
               <v13:Weight>
                  <v13:Units>LB</v13:Units>
                  <v13:Value>180.0</v13:Value>
               </v13:Weight>
               <v13:Dimensions>
                  <v13:Length>12</v13:Length>
                  <v13:Width>12</v13:Width>
                  <v13:Height>12</v13:Height>
                  <v13:Units>IN</v13:Units>
               </v13:Dimensions>
               <v13:CustomerReferences>
                  <v13:CustomerReferenceType>CUSTOMER_REFERENCE</v13:CustomerReferenceType>
                  <v13:Value>TC001_01_PT1_ST01_PK01_SNDUS_RCPCA_POS</v13:Value>
               </v13:CustomerReferences>
               <v13:SpecialServicesRequested>
                  <v13:SpecialServiceTypes>DANGEROUS_GOODS</v13:SpecialServiceTypes>
                  <v13:DangerousGoodsDetail>
                     <v13:Accessibility>ACCESSIBLE</v13:Accessibility>
                  </v13:DangerousGoodsDetail>
               </v13:SpecialServicesRequested>
            </v13:RequestedPackageLineItems>
         </v13:RequestedShipment>
      </v13:RateRequest>
   </soapenv:Body>
</soapenv:Envelope>